00001  IDENTIFICATION DIVISION.
00002  PROGRAM-ID.     "HELLOWORLD".
00003  AUTHOR.         carlinhoshk.
00004 *Isso é um comentario em COBOL usando asteristico
00005 *Colunas 8-11 são a margem A
00006 *Clounas 12-72 são a margem B
00007  ENVIRONMENT DIVISION.
00008  
00009  DATA DIVISION.
000010 
000011 PROCEDURE DIVISION.
000012 0100-START-HERE.
000013     DISPLAY "OLÁ MUNDO".
000014 STOP RUN.
000015 END PROGRAM HELLOWORLD.
